c5/src/Documents/OutgoingEmail/OutgoingEmail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>OutgoingEmail</name>
  <attributes>
    <name>AttachmentsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Brief</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Cc</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <type>
      <types>EnumRef.Importance</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomingEmail</name>
    <type>
      <types>DocumentRef.IncomingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>Key</name>
    <type>
      <types>CatalogRef.MailKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Mailbox</name>
    <type>
      <types>CatalogRef.Mailboxes</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplyTo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SenderName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerMessageID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Table</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>TableDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TableType</name>
    <type>
      <types>EnumRef.TableTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Attachments</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Extension</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>File</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Size</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Emails</name>
    <attributes>
      <name>Email</name>
      <type>
        <types>DocumentRef.IncomingEmail</types>
        <types>DocumentRef.OutgoingEmail</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/Document/Document.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Document</name>
  <posting>Deny</posting>
  <attributes>
    <name>AttachmentsContent</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Book</name>
    <type>
      <types>CatalogRef.Books</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>FolderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsEmpty</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Link</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Object</name>
    <type>
      <types>DefinedType.DocumentObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecialAccess</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Table</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Versioning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Changes</name>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>600</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ComputerName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Version</name>
      <type>
        <types>DocumentRef.Document</types>
        <types>DocumentRef.DocumentVersion</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/CommonForms/Print/Module.bsl
&AtClient
var PreviousArea;
&AtClient
var TotalsEnv;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	result = PrintSrv.Print ( Parameters.Params, Parameters.Language );
	if ( result = undefined ) then
		Cancel = true;
		return;
	endif; 
	applyResult ( result );
	setEditModeButton ( Items );
	
EndProcedure

&AtServer
Procedure applyResult ( Result )
	
	TabDoc = Result.TabDoc;
	Reference = result.Reference;
	params = Parameters.Params;
	if ( params.Caption = undefined ) then
		Title = PrintSrv.GetFormCaption ( params.Name + Parameters.Language, params.Manager, params.Objects [ 0 ] );
	else
		Title = Parameters.Caption;
	endif; 
	
EndProcedure

&AtClient
Procedure OnOpen ( Cancel )
	
	setCommandBarButtonsVisibility ();

EndProcedure

&AtClient
Procedure setCommandBarButtonsVisibility ()
	
	#if ( WebClient ) then
		Items.TabDocShowHeaders.Visible = false;
		Items.TabDocShowGrid.Visible = false;
	#endif 
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure SendFormByEmail ( Command )
	
	organizeDelivery ();
	
EndProcedure

&AtClient
Procedure organizeDelivery ()
	
	info = deliveryInfo ( Reference );
	params = Mailboxes.GetEmailParams ();
	params.To = info.To;
	params.Subject = "" + Reference + ", " + info.From;
	params.TableDescription = Title;
	params.TableAddress = PutToTempStorage ( TabDoc, UUID );
	p = new Structure ( "Delivery", params );
	if ( info.EmailClient ) then
		OpenForm ( "Document.OutgoingEmail.ObjectForm", p );
	else
		OpenForm ( "CommonForm.Send", p );
	endif;
	
EndProcedure 

&AtServerNoContext
Function deliveryInfo ( val Reference )
	
	info = new Structure ( "EmailClient, To, From" );
	info.EmailClient = IsInRole ( Metadata.Roles.Email )
	and not ( Environment.MobileClient () or MailboxesSrv.Default ().IsEmpty () );
	if ( Reference = undefined ) then
		info.To = "";
	elsif ( Metafields.Exists ( Reference, "Customer" ) ) then
		info.To = DF.Pick ( Reference, "Customer.Email" );
	elsif ( Metafields.Exists ( Reference, "Vendor" ) ) then
		info.To = DF.Pick ( Reference, "Vendor.Email" );
	else
		info.To = "";
	endif;
	if ( Reference <> undefined
		and Metafields.Exists ( Reference, "Company" ) ) then
		info.From = DF.Pick ( Reference, "Company" );
	else
		info.From = Application.Company ();
	endif;
	return info;

EndFunction 

&AtClient
Procedure ChangeEditMode ( Command )
	
	setTabDocEdit ();
	setEditModeButton ( Items );
	
EndProcedure

&AtClient
Procedure setTabDocEdit ()
	
	Items.TabDoc.Edit = not Items.TabDoc.Edit;
	
EndProcedure

&AtClientAtServerNoContext
Procedure setEditModeButton ( Items )
	
	Items.TabDocChangeEditMode.Check = Items.TabDoc.Edit;
	
EndProcedure

&AtClient
Procedure ShowHeaders ( Command )
	
	setShowHeadersMode ();
	setShowHeadersButton ();
	
EndProcedure

&AtClient
Procedure setShowHeadersMode ()
	
	Items.TabDoc.ShowHeaders = not Items.TabDoc.ShowHeaders;

EndProcedure

&AtClient
Procedure setShowHeadersButton ()
	
	Items.TabDocShowHeaders.Check = Items.TabDoc.ShowHeaders;
	
EndProcedure

&AtClient
Procedure ShowGrid ( Command )
	
	setShowGridMode ();
	setShowGridButton ();
	
EndProcedure

&AtClient
Procedure setShowGridMode ()
	
	Items.TabDoc.ShowGrid = not Items.TabDoc.ShowGrid;

EndProcedure

&AtClient
Procedure setShowGridButton ()
	
	Items.TabDocShowGrid.Check = Items.TabDoc.ShowGrid;
	
EndProcedure

&AtClient
Procedure SaveToDocuments ( Command )
	
	openDocument ();
	
EndProcedure

&AtClient
Procedure openDocument ()
	
	values = new Structure ();
	values.Insert ( "Object", Reference );
	values.Insert ( "Subject", String ( Reference ) );
	values.Insert ( "TabDoc", TabDoc );
	p = new Structure ( "FillingValues", values );
	p.Insert ( "Command", Enum.DocumentCommandsUploadPrintForm () );
	p.Insert ( "TabDoc", TabDoc );
	OpenForm ( "Document.Document.ObjectForm", p );
	
EndProcedure

&AtClient
Procedure TabDocOnChange ( Item )
	
	PreviousArea = undefined;
	
EndProcedure

&AtClient
Procedure TabDocOnActivateArea ( Item )

	if ( drawing ()
		or sameArea () ) then
		return;
	endif;
	startCalculation ();
	
EndProcedure

&AtClient
Function drawing ()
	
	return TypeOf ( TabDoc.CurrentArea ) <> Type ( "SpreadsheetDocumentRange" );
	
EndFunction 

&AtClient
Function sameArea ()
	
	currentName = TabDoc.CurrentArea.Name;
	if ( PreviousArea = currentName ) then
		return true;
	else
		PreviousArea = currentName;
		return false;
	endif; 
	
EndFunction

&AtClient
Procedure startCalculation ()
	
	DetachIdleHandler ( "startUpdating" );
	AttachIdleHandler ( "startUpdating", 0.2, true );
	
EndProcedure 

&AtClient
Procedure startUpdating ()
	
	updateTotals ( true );
	
EndProcedure

&AtClient
Procedure updateTotals ( CheckSquare )
	
	if ( TotalsEnv = undefined ) then
		SpreadsheetTotals.Init ( TotalsEnv );	
	endif;
	TotalsEnv.Spreadsheet = TabDoc;
	TotalsEnv.CheckSquare = CheckSquare;
	SpreadsheetTotals.Update ( TotalsEnv );
	Items.CalcTotals.Visible = CheckSquare and TotalsEnv.HugeSquare;
	TotalInfo = TotalsEnv.Result; 
	
EndProcedure

&AtClient
Procedure CalcTotals ( Command )
	
	updateTotals ( false );
	
EndProcedure
